XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/SONiX.SN32F2_DFP.pdsc
	        <!-- *************************  Device 'SN32F267J'  ***************************** -->
      <device Dname="SN32F267J">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F260.h"  define="SN32F260"/>
        <debug      svd="SVD\SN32F260.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x77FC"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F260_30.FLM"    start="0x00000000"  size="0x7800"                  default="1"/>
        <feature type="IOs"           n="40"/>
        <feature type="QFN"           n="46"/>
      </device>	  
	  
	  	  	<!-- *************************  Device 'SN32F265J'  ***************************** -->
      <device Dname="SN32F265J">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F260.h"  define="SN32F260"/>
        <debug      svd="SVD\SN32F260.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x77FC"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F260_30.FLM"    start="0x00000000"  size="0x7800"                  default="1"/>
        <feature type="IOs"      n="26"/>
        <feature type="QFN"      n="32"/>
      </device>	 
	
	   <!-- *************************  Device 'SN32F264S/X'  ***************************** -->
      <device Dname="SN32F264S/X">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F260.h"  define="SN32F260"/>
        <debug      svd="SVD\SN32F260.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x77FC"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F260_30.FLM"    start="0x00000000"  size="0x7800"                  default="1"/>
        <feature type="IOs"           n="22"/>
        <feature type="SOP"      n="28"/>
		<feature type="Other" 	 n="28" 		name="SSOP"/>
      </device>	 

	  <!-- *************************  Device 'SN32F2641J'  ***************************** -->
      <device Dname="SN32F2641J">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F260.h"  define="SN32F260"/>
        <debug      svd="SVD\SN32F260.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x77FC"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F260_30.FLM"    start="0x00000000"  size="0x7800"                  default="1"/>
        <feature type="IOs"      n="22"/>
        <feature type="QFN"      n="28"/>
      </device>	 
	  
	  <!-- *************************  Device 'SN32F263X'  ***************************** -->
      <device Dname="SN32F263X">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F260.h"  define="SN32F260"/>
        <debug      svd="SVD\SN32F260.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x77FC"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F260_30.FLM"    start="0x00000000"  size="0x7800"                  default="1"/>
        <feature type="IOs"       n="18"/>
		<feature type="Other" 	  n="24" 			name="SSOP"/>
      </device>	 	  
	 </subFamily>  
	  
	  <!-- ************************  Subfamily 'SN32F240B'  **************************** -->
      <subFamily DsubFamily="SN32F240B">
      
	  <!-- *************************  Device 'SN32F248BF'  ***************************** -->
      <device Dname="SN32F248BF">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F240B.h"  define="SN32F240B"/>
        <debug      svd="SVD\SN32F240B.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xFFFC"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F240B_64.FLM"   start="0x00000000"  size="0x10000"                  default="1"/>
		<algorithm  name="Flash\SN32F240B_CO.FLM"   start="0x1FFF2000"  size="0x0040"                   default="1"/>
        <feature type="IOs"           n="57"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="UART"          n="3"/>
		<feature type="I2C"	          n="1"/>
		<feature type="SPI"           n="1"/>
        <feature type="PWM"           n="24"/>
        <feature type="QFP"           n="64"/>
      </device>
	  
	   <!-- *************************  Device 'SN32F247BF'  ***************************** -->
      <device Dname="SN32F247BF">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F240B.h"  define="SN32F240B"/>
        <debug      svd="SVD\SN32F240B.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xFFFC"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F240B_64.FLM"   start="0x00000000"  size="0x10000"                  default="1"/>
		<algorithm  name="Flash\SN32F240B_CO.FLM"   start="0x1FFF2000"  size="0x0040"                   default="1"/>
        <feature type="IOs"           n="41"/>
        <feature type="ADC"           n="13"      m="12"/>
        <feature type="UART"          n="3"/>
		<feature type="I2C"	          n="1"/>
		<feature type="SPI"           n="1"/>
        <feature type="PWM"           n="24"/>
        <feature type="QFP"           n="48"/>
      </device>
	  
