XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/SONiX.SN32F2_DFP.pdsc
	   <!-- *************************  Device 'SN32F246BJ'  ***************************** -->
      <device Dname="SN32F246BJ">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F240B.h"  define="SN32F240B"/>
        <debug      svd="SVD\SN32F240B.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xFFFC"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F240B_64.FLM"   start="0x00000000"  size="0x10000"                  default="1"/>
		<algorithm  name="Flash\SN32F240B_CO.FLM"   start="0x1FFF2000"  size="0x0040"                   default="1"/>
        <feature type="IOs"           n="39"/>
        <feature type="ADC"           n="11"      m="12"/>
        <feature type="UART"          n="3"/>
		<feature type="I2C"	          n="1"/>
		<feature type="SPI"           n="1"/>
        <feature type="PWM"           n="23"/>
        <feature type="QFN"           n="46"/>
      </device>
	  
	   <!-- *************************  Device 'SN32F2451BJ'  ***************************** -->
      <device Dname="SN32F2451BJ">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F240B.h"  define="SN32F240B"/>
        <debug      svd="SVD\SN32F240B.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xFFFC"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\SN32F240B_64.FLM"   start="0x00000000"  size="0x10000"                  default="1"/>
		<algorithm  name="Flash\SN32F240B_CO.FLM"   start="0x1FFF2000"  size="0x0040"                   default="1"/>
        <feature type="IOs"           n="24"/>
        <feature type="ADC"           n="6"      m="12"/>
        <feature type="UART"          n="3"/>
		<feature type="I2C"	          n="1"/>
		<feature type="SPI"           n="1"/>
        <feature type="PWM"           n="17"/>
        <feature type="QFN"           n="33"/>
      </device>
      </subFamily>

	  <!-- ************************  Subfamily 'SN32F280'  **************************** -->
      <subFamily DsubFamily="SN32F280">
	  
	  <!-- *************************  Device 'SN32F289F'  ***************************** -->
      <device Dname="SN32F289F">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F280.h"  define="SN32F280"/>
        <debug      svd="SVD\SN32F280.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x1FFFC"	startup="1"	default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"	init   ="0"	default="1"/>
        <algorithm  name="Flash\SN32F280_128.FLM"    start="0x00000000"  size="0x20000"             default="1"/>
        <feature type="IOs"           n="74"/>
        <feature type="ADC"           n="16"/>
        <feature type="UART"          n="4"/>
		<feature type="I2C"	          n="2"/>
		<feature type="I2S"	          n="2"/>
		<feature type="SPI"           n="2"/>
        <feature type="PWM"           n="36"/>
		<feature type="Other"         n="3"                           name="CMP"/>
        <feature type="Other"         n="2"                           name="OPA"/>
        <feature type="Other"         n="1"                           name="EBI"/>
        <feature type="Other"         n="1"                           name="CRC"/>
		<feature type="LCD"           n="36"	m="8"/>
        <feature type="QFP"          n="80"/>
      </device>
	  
	  <!-- *************************  Device 'SN32F288F'  ***************************** -->
      <device Dname="SN32F288F">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F280.h"  define="SN32F280"/>
        <debug      svd="SVD\SN32F280.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x1FFFC"	startup="1"	default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"	init   ="0"	default="1"/>
        <algorithm  name="Flash\SN32F280_128.FLM"    start="0x00000000"  size="0x20000"             default="1"/>
        <feature type="IOs"           n="58"/>
        <feature type="ADC"           n="16"/>
        <feature type="UART"          n="4"/>
		<feature type="I2C"	          n="2"/>
		<feature type="I2S"	          n="2"/>
		<feature type="SPI"           n="2"/>
        <feature type="PWM"           n="36"/>
		<feature type="Other"         n="3"                           name="CMP"/>
        <feature type="Other"         n="2"                           name="OPA"/>
        <feature type="Other"         n="1"                           name="EBI"/>
        <feature type="Other"         n="1"                           name="CRC"/>
		<feature type="LCD"           n="31"	m="8"/>
        <feature type="QFP"          n="64"/>
      </device>
	  
	  <!-- *************************  Device 'SN32F287F'  ***************************** -->
      <device Dname="SN32F287F">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F280.h"  define="SN32F280"/>
        <debug      svd="SVD\SN32F280.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x1FFFC"	startup="1"	default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"	init   ="0"	default="1"/>
        <algorithm  name="Flash\SN32F280_128.FLM"    start="0x00000000"  size="0x20000"             default="1"/>
        <feature type="IOs"           n="42"/>
        <feature type="ADC"           n="10"/>
        <feature type="UART"          n="4"/>
		<feature type="I2C"	          n="2"/>
		<feature type="I2S"	          n="2"/>
		<feature type="SPI"           n="2"/>
        <feature type="PWM"           n="36"/>
		<feature type="Other"         n="3"                           name="CMP"/>
        <feature type="Other"         n="2"                           name="OPA"/>
        <feature type="Other"         n="1"                           name="EBI"/>
        <feature type="Other"         n="1"                           name="CRC"/>
		<feature type="LCD"           n="21"	m="4"/>
        <feature type="QFP"          n="48"/>
      </device>
      </subFamily>
	  
	  <!-- ************************  Subfamily 'SN32F290'  **************************** -->
      <subFamily DsubFamily="SN32F290">
	  
