XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/SONiX.SN32F2_DFP.pdsc
	  <!-- *************************  Device 'SN32F299F'  ***************************** -->
      <device Dname="SN32F299F">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F290.h"  define="SN32F290"/>
        <debug      svd="SVD\SN32F290.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x3FFFC"	startup="1"	default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"	init   ="0"	default="1"/>
        <algorithm  name="Flash\SN32F290_256.FLM"    start="0x00000000"  size="0x20000"             default="1"/>
        <feature type="IOs"           n="74"/>
        <feature type="ADC"           n="16"/>
        <feature type="UART"          n="4"/>
		<feature type="I2C"	          n="2"/>
		<feature type="I2S"	          n="2"/>
		<feature type="SPI"           n="2"/>
        <feature type="PWM"           n="36"/>
		<feature type="Other"         n="3"                           name="CMP"/>
        <feature type="Other"         n="2"                           name="OPA"/>
        <feature type="Other"         n="1"                           name="EBI"/>
        <feature type="Other"         n="1"                           name="CRC"/>
		<feature type="LCD"           n="36"	m="8"/>
        <feature type="QFP"          n="80"/>
      </device>
	  
	  <!-- *************************  Device 'SN32F298F'  ***************************** -->
      <device Dname="SN32F298F">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F290.h"  define="SN32F290"/>
        <debug      svd="SVD\SN32F290.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x3FFFC"	startup="1"	default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"	init   ="0"	default="1"/>
        <algorithm  name="Flash\SN32F290_256.FLM"    start="0x00000000"  size="0x20000"             default="1"/>
        <feature type="IOs"           n="58"/>
        <feature type="ADC"           n="16"/>
        <feature type="UART"          n="4"/>
		<feature type="I2C"	          n="2"/>
		<feature type="I2S"	          n="2"/>
		<feature type="SPI"           n="2"/>
        <feature type="PWM"           n="36"/>
		<feature type="Other"         n="3"                           name="CMP"/>
        <feature type="Other"         n="2"                           name="OPA"/>
        <feature type="Other"         n="1"                           name="EBI"/>
        <feature type="Other"         n="1"                           name="CRC"/>
		<feature type="LCD"           n="31"	m="8"/>
        <feature type="QFP"          n="64"/>
      </device>
	  
	  <!-- *************************  Device 'SN32F297F'  ***************************** -->
      <device Dname="SN32F297F">
        <processor Dclock="48000000"/>
        <compile header="Device\Include\SN32F290.h"  define="SN32F290"/>
        <debug      svd="SVD\SN32F290.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x3FFFC"	startup="1"	default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"	init   ="0"	default="1"/>
        <algorithm  name="Flash\SN32F290_256.FLM"    start="0x00000000"  size="0x20000"             default="1"/>
        <feature type="IOs"           n="42"/>
        <feature type="ADC"           n="10"/>
        <feature type="UART"          n="4"/>
		<feature type="I2C"	          n="2"/>
		<feature type="I2S"	          n="2"/>
		<feature type="SPI"           n="2"/>
        <feature type="PWM"           n="36"/>
		<feature type="Other"         n="3"                           name="CMP"/>
        <feature type="Other"         n="2"                           name="OPA"/>
        <feature type="Other"         n="1"                           name="EBI"/>
        <feature type="Other"         n="1"                           name="CRC"/>
		<feature type="LCD"           n="21"	m="4"/>
        <feature type="QFP"          n="48"/>
      </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>
    
    <condition id="SN32F23_4">
      <description>SONiX SN32F2230_40 Series devices</description>
      <accept Dvendor="SONiX:110" Dname="SN32F23??"/>
      <accept Dvendor="SONiX:110" Dname="SN32F24??"/>
    </condition>
	
    <condition id="SN32F26">
      <description>SONiX SN32F260 Series devices</description>
      <accept Dvendor="SONiX:110" Dname="SN32F26*"/>
    </condition>
	
	<condition id="SN32F240B">
      <description>SONiX SN32F240B Series devices</description>
      <accept Dvendor="SONiX:110" Dname="SN32F24*B*"/>
    </condition>
	
	<condition id="SN32F28">
      <description>SONiX SN32F280 Series devices</description>
      <accept Dvendor="SONiX:110" Dname="SN32F28*"/>
    </condition>
	
	<condition id="SN32F29">
      <description>SONiX SN32F290 Series devices</description>
	  <accept Dvendor="SONiX:110" Dname="SN32F29*"/>
    </condition>
	
    <condition id="SN32F23_4 CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>SONiX SN32F230_40 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="SN32F23_4"/>
    </condition>

	<condition id="SN32F26 CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>SONiX SN32F260 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="SN32F26"/>
    </condition>
	
	<condition id="SN32F240B CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>SONiX SN32F240B Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="SN32F240B"/>
    </condition>
	
	<condition id="SN32F28 CMSIS Device">
      <description>SONiX SN32F280 series Devices and CMSIS-Core</description>
	  <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="SN32F28"/> 
    </condition>
	
	<condition id="SN32F29 CMSIS Device">
      <description>SONiX SN32F290 series Devices and CMSIS-Core</description>
	  <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="SN32F29"/> 
    </condition>
