XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/SONiX.SN32F2_DFP.pdsc
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.1" condition="SN32F23_4 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for SONiX SN32F230_40 Series</description>

      <files>
        <file category="include"	name="Device\Include\"/>
        <file category="sourceAsm"	name="Device\Source\ARM\startup_SN32F240.s"    attr="config"	version="1.1.0"	condition="Compiler ARM"/>
        <file category="sourceC"	name="Device\Source\system_SN32F240.c"         attr="config"    version="1.1.1"/>
      </files>
    </component>
	
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.3" condition="SN32F26 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for SONiX SN32F260 Series</description>

      <files>
        <file category="include"	name="Device\Include\"/>
        <file category="sourceAsm"	name="Device\Source\ARM\startup_SN32F260.s"    attr="config"	version="1.0.2"	condition="Compiler ARM"/>
        <file category="sourceC"	name="Device\Source\system_SN32F260.c"         attr="config"    version="1.0.3"/>
      </files>
    </component>
	
	<component Cclass="Device" Cgroup="Startup" Cversion="1.1.1" condition="SN32F240B CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for SONiX SN32F240B Series</description>

      <files>
        <file category="include"	name="Device\Include\"/>
        <file category="sourceAsm"	name="Device\Source\ARM\startup_SN32F240B.s"    attr="config"	version="1.1.1"	condition="Compiler ARM"/>
        <file category="sourceC"	name="Device\Source\system_SN32F240B.c"         attr="config"    version="1.0.2"/>
      </files>
    </component>
	
    <component Cclass="Device" Cgroup="Startup" Cversion="0.0.1" condition="SN32F28 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for SONiX SN32F280 Series</description>
      <files>
        <file category="include"	name="Device\Include\"/>
        <file category="sourceAsm"	name="Device\Source\ARM\startup_SN32F280.s"   attr="config"    version="0.0.1"	condition="Compiler ARM"/>
        <file category="sourceC"	name="Device\Source\system_SN32F280.c"        attr="config"    version="0.0.1"/>
      </files>
    </component>
	
	<component Cclass="Device" Cgroup="Startup" Cversion="0.0.1" condition="SN32F29 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for SONiX SN32F290 Series</description>
      <files>
        <file category="include"	name="Device\Include\"/>
        <file category="sourceAsm"	name="Device\Source\ARM\startup_SN32F290.s"   attr="config"    version="0.0.1"	condition="Compiler ARM"/>
        <file category="sourceC"	name="Device\Source\system_SN32F290.c"        attr="config"    version="0.0.1"/>
      </files>
    </component>
  </components>
</package>
